# -*- mode: org -*-
# -*- coding: utf-8 -*-
#+STARTUP: overview
#+STARTUP: indent

#+TITLE:     Dicas sobre dúvidas e erros recorrentes no aprendizado da linguagem ~C~
#+AUTHOR:    Prof. Vinícius Garcia Pinto                                                                                                              
#+EMAIL:     vinicius.pinto@inf.ufrgs.br                                                                                                              
#+DATE:      2019/1

#+LANGUAGE: pt_BR
#+OPTIONS: creator:nil timestamp:nil skip:nil email:nil toc:nil num:t ^:nil ~:~ 
#+TAGS: noexport(n) deprecated(d) ignore(i)
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

#+LATEX_HEADER: \usepackage[brazilian]{babel}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage[T1]{fontenc}

# this should be in local variables, but it is not working yet
#+LATEX_HEADER: \usepackage{xcolor}

# No label in figures and tables (e.g. Figure 1. bla bla bla)
#+LATEX_HEADER: \usepackage[labelformat=empty]{caption}


Este documento reúne algumas dicas sobre dúvidas e erros recorrentes
no aprendizado da linguagem C. Antes de solicitar ajuda, recomenda-se
a consulta a esta lista a fim de verificar se o problema/dúvida não se
enquadra em um dos casos abaixo. Sugestões e correções são bem-vindas
pelo e-mail: vinicius.pinto@inf.ufrgs.br.

*** Variáveis do tipo ~int~                                          :ignore:
#+CAPTION: *Variáveis do tipo ~int~*
#+ATTR_LATEX: :options inputencoding=utf8, frame=single, showstringspaces=false, basicstyle=\ttfamily\footnotesize, keywordstyle=\bfseries\color{green!40!black}, commentstyle=\itshape\color{purple!40!black}, identifierstyle=\color{blue}, stringstyle=\color{orange}, extentedchars=true, literate={á}{{\'a}}1 {à}{{\`a}}1 {ã}{{\~a}}1 {é}{{\'e}}1 {ê}{{\^e}}1 {í}{{\'i}}1 {ó}{{\'o}}1 {õ}{{\~o}}1 {ú}{{\'u}}1 {ü}{{\"u}}1 {ç}{{\c{c}}}1
#+begin_src C :exports both :results output :eval no-export
#include<limits.h>

int varA = INT_MAX;
int varB = INT_MIN;

printf("varA contem o maior valor possivel (int): %d ", varA);
printf("\n");
printf("varB contem o menor valor possivel (int): %d ", varB);
printf("\n");
#+end_src

#+RESULTS:
: varA contem o maior valor possivel (int): 2147483647 
: varB contem o menor valor possivel (int): -2147483648


*** Variáveis do tipo ~float~                                        :ignore:
#+name: flt-max-min
#+CAPTION: *Variáveis do tipo ~float~*
#+ATTR_LATEX: :options frame=single, basicstyle=\ttfamily\scriptsize
#+begin_src C :exports both :results output code :wrap "SRC fundamental" :eval no-export
#include<float.h>

float varA = FLT_MAX;
float varB = FLT_MIN;

printf("varA contem o maior valor possivel (float): \n  %f ", varA);
printf("\n");
printf("varB contem o menor valor possivel (float): \n  %.60f", varB);
printf("\n");

printf("\nNotacao Exponencial: \n");
printf("varA contem o maior valor possivel (float): \n  %e ", varA);
printf("\n");
printf("varB contem o menor valor possivel (float): \n  %e ", varB);
printf("\n");
#+end_src

#+RESULTS: flt-max-min
: varA contem o maior valor possivel (float): 
:   340282346638528859811704183484516925440.000000 
: varB contem o menor valor possivel (float): 
:   0.000000000000000000000000000000000000011754943508222875079687
: 
: Notacao Exponencial: 
: varA contem o maior valor possivel (float): 
:   3.402823e+38 
: varB contem o menor valor possivel (float): 
:   1.175494e-38

